Лабораторная работа начинается с установки ssh-ключей. Открываю терминал и ввожу команду ssh-keygen, выбираю файл, куда сохранить ключ, перемещаюсь туда с помощью cd, затем с помощью команды cat открываю содержимое файла для чтения, копирую ключ. (рис.1)
![рис.1](https://github.com/a-orlova/lab1-orlova-a-a/blob/main/Рисунок1.png)
После этого загружаю его на гитхаб. (рис.2)
 
Загрузив ssh ключ я копирую репозиторий с этой лабораторной работой к себе на компьютер. Выясняется, что у меня не установлена команда git, поэтому пытаюсь установить её с помощью sudo apt install git. Однако также оказывается, что у меня нет на это прав. (рис.3)

 
Начинаю работу по выдаче себе этих прав. Моя цель – добавить себя в эту группу sudoers. Я переключаюсь на пользователя root, потому что alena не может выполнять никаких административных задач. (рис.4)
 
 
После того, как я переключилась, я буду редактировать файл sudoers, используя nano. Это текстовый редактор, который дает возможность редактировать файлы из командной строки.
Я дописываю новую строку в привилегии пользователя. Это предоставило мне, как обычному пользователю, привилегии суперпользователя, и теперь я могу выполнять задачи, требующие root-доступа. (рис.5)

 

Сохраняю изменения и выхожу из этой сессии. Теперь мне все-таки удалось установить команду git, и я смогла скопировать репозиторий. (рис.6, рис.7)

 
 
Перехожу в клонированный репозиторий с помощью cd, создаю там файл script.bash с помощью команды touch. Далее использую команду gedit для редактирования этого файла. Выполняю пробное тренировочное задание перед выполнением основного. Все получается верно! (рис.8, рис.9)

 

 

Теперь выполняю само задание. Снова открываю файл для редактирования через gedit, там, чтобы модифицировать файл нужным образом, ввожу команду: 

#!/bin/bash
echo "Welcome, $@"

$@ - такая запись используется для получения всех аргументов, переданных пользователем скрипту, в виде списка. Как раз это и помогает обрабатывать сложные имена из нескольких слов, по типу “Benedict Timothy Carlton Cumberbatch”. (рис.10, рис.11)

 

 

Теперь копирую созданных файл в свой репозиторий на гитхаб. Для этого ввожу команду git add script.bash. Чтобы добавить коммит (то есть моментальная фиксация изменения в репозитории к файлу, пишу команду git commit -m "I did the first task!", затем загружаю с помощью git push origin master. С master у меня возникла ошибка, поэтому заменила это слово в команде на main. (рис.12, рис.13)

 

 

 В итоге файл script.bash загрузился на гитхаб с нужным коммитом. Задание выполнено!
